In [59]:
import pandas as pd

In [60]:
import numpy as np

In [123]:
data = pd.read_csv('../data/athlete_events.csv')
data.head()

,ID,Name,Sex,Age,Height,Weight,Team,NOC,Games,Year,Season,City,Sport,Event,Medal
0,1,A Dijiang,M,24.0,180.0,80.0,China,CHN,1992 Summer,1992,Summer,Barcelona,Basketball,Basketball Men's Basketball,NaN
1,2,A Lamusi,M,23.0,170.0,60.0,China,CHN,2012 Summer,2012,Summer,London,Judo,Judo Men's Extra-Lightweight,NaN
2,3,Gunnar Nielsen Aaby,M,24.0,NaN,NaN,Denmark,DEN,1920 Summer,1920,Summer,Antwerpen,Football,Football Men's Football,NaN
3,4,Edgar Lindenau Aabye,M,34.0,NaN,NaN,Denmark/Sweden,DEN,1900 Summer,1900,Summer,Paris,Tug-Of-War,Tug-Of-War Men's Tug-Of-War,Gold
4,5,Christine Jacoba Aaftink,F,21.0,185.0,82.0,Netherlands,NED,1988 Winter,1988,Winter,Calgary,Speed Skating,Speed Skating Women's 500 metres,NaN

In [475]:
pd.set_option('display.max_columns', 100)
pd.set_option('display.max_rows', 10)

In [476]:
pd.crosstab(data['Year'],data['Sex'],values=data['Age'],aggfunc=np.min).T

Year,1896,1900,1904,1906,1908,1912,1920,1924,1928,1932,1936,1948,1952,1956,1960,1964,1968,1972,1976,1980,1984,1988,1992,1994,1996,1998,2000,2002,2004,2006,2008,2010,2012,2014,2016
Sex,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,
F,NaN,13.0,24.0,21.0,21.0,13.0,13.0,11.0,11.0,11.0,11.0,12.0,13.0,12.0,11.0,12.0,11.0,13.0,12.0,13.0,13.0,11.0,12.0,13.0,12.0,15.0,13.0,15.0,13.0,14.0,12.0,15.0,13.0,15.0,13.0
M,10.0,15.0,14.0,13.0,14.0,15.0,13.0,14.0,13.0,13.0,12.0,13.0,12.0,13.0,13.0,13.0,12.0,12.0,14.0,13.0,12.0,12.0,11.0,15.0,14.0,14.0,14.0,15.0,14.0,15.0,13.0,15.0,15.0,15.0,14.0

In [477]:
data.groupby(['Year','Sex'])['Age'].min()

Year  Sex
1896  M      10.0
1900  F      13.0
      M      15.0
1904  F      24.0
      M      14.0
             ...
2012  M      15.0
2014  F      15.0
      M      15.0
2016  F      13.0
      M      14.0
Name: Age, Length: 69, dtype: float64

In [481]:
Gymnastic_men = data[(data['Year']==2000)&(data['Sex']=='M')&(data['Sport']=='Gymnastics')].drop_duplicates(subset='Name').shape[0]

In [482]:
Participants_2000_m = data[(data['Year']==2000)&(data['Sex']=='M')].drop_duplicates(subset='Name').shape[0]

In [489]:
print(Gymnastic_men)
print(Participants_2000_m)
print(round(Gymnastic_men/Participants_2000_m*100,1),'%')

97
6576
1.5 %

In [492]:
datas = data[data['Year']==2000]
pd.crosstab(datas['Sport'],datas['Sex'],values=datas['Height'],aggfunc=[np.mean,np.std]).round(1)

                mean         std
Sex                F      M    F     M
Sport
Archery        167.9  179.8  5.1   7.2
Athletics      169.6  181.5  7.8   8.1
Badminton      168.6  179.9  6.6   6.6
Baseball         NaN  182.4  NaN   7.0
Basketball     182.4  199.5  9.1   9.0
...              ...    ...  ...   ...
Triathlon      166.1  179.7  5.7   6.0
Volleyball     181.7  196.1  7.5   7.0
Water Polo     174.8  190.1  6.0   6.6
Weightlifting  160.7  170.1  7.7  10.2
Wrestling        NaN  174.5  NaN   9.3

[34 rows x 4 columns]

In [494]:
datax = data[(data['Sex']=='F')&(data['Sport']=='Basketball')&(data['Year']==2000)]
datax.groupby('Sport')['Height'].agg([np.mean, np.std]).round(1)

             mean  std
Sport
Basketball  182.4  9.1

In [500]:
Wdata = data[data['Year']==2002]['Weight'].max()
data[(data['Year']==2002)&(data['Weight']==Wdata)]['Sport']

99154    Bobsleigh
Name: Sport, dtype: object

In [502]:
data[data['Name'].str.startswith('Pawe Abratkiewicz')]['Year'].unique().shape[0]

3

In [503]:
data[(data['Sport']=='Tennis')&(data['Team']=='Australia')&(data['Year']==2000)&(data['Medal']=='Silver')]['Medal'].shape[0]

2

In [515]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 271116 entries, 0 to 271115
Data columns (total 16 columns):
ID         271116 non-null int64
Name       271116 non-null object
Sex        271116 non-null object
Age        261642 non-null float64
Height     210945 non-null float64
Weight     208241 non-null float64
Team       271116 non-null object
NOC        271116 non-null object
Games      271116 non-null object
Year       271116 non-null int64
Season     271116 non-null object
City       271116 non-null object
Sport      271116 non-null object
Event      271116 non-null object
Medal      39783 non-null object
cat_Age    133434 non-null object
dtypes: float64(3), int64(2), object(11)
memory usage: 21.7+ MB

In [541]:
Switzerland = data[(data['Team']=='Switzerland')&(data['Year']==2016)].dropna()['Medal'].shape[0]

In [545]:
Serbia = data[(data['Team']=='Serbia')&(data['Year']==2016)].dropna()['Medal'].shape[0]

In [534]:
if Switzerland < Serbia:
    print(Switzerland,Serbia,True)
else:
    print(Switzerland,Serbia,False)

2 12 True

In [451]:
def get_cat_by_age(x):
    if 45 <= x <=55:
        return 'Old'
    elif 15 <= x <25:
        return 'young'

In [453]:
data_w_d = data.drop_duplicates(subset='Name')
data['cat_Age']=data['Age'].apply(get_cat_by_age)
data_w_d['cat_Age'].value_counts()

young    75941
Old       1153
Name: cat_Age, dtype: int64

In [468]:
print(data[(data['City']=='Lake Placid')&(data['Season']=='Summer')].shape[0])
print(data[(data['City']=='Sankt Moritz')&(data['Season']=='Winter')].shape[0])

0
1657

In [474]:
np.abs(data[data['Year']==1995]['Sport'].unique().shape[0]-data[data['Year']==2016]['Sport'].unique().shape[0])

34